In [52]:

import pandas as pd
import urllib

# https://image-net.org/api/imagenet.attributes.obtain_synset_wordlist.php
sysnets = pd.read_csv('../labels.csv')
sysnet_ids = sysnets['sysnet_id'][:5]

for sysnet_id in sysnet_ids:
    print(sysnet_id)
    url, filename = ("https://image-net.org/data/winter21_whole/" + sysnet_id  + ".tar",  sysnet_id  + ".tar")
    try: urllib.URLopener().retrieve(url, filename)
    except: urllib.request.urlretrieve(url, filename)

n01440764
n01443537
n01484850
n01491361
n01494475

In [40]:
import pandas as pd
sysnet_label_df = pd.read_csv('../sysnets_classes.csv', delimiter=":")
sysnet_label_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   sysnet_id  1000 non-null   object
 1   label      1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [41]:
sysnet_label_df.head(10)

   sysnet_id                                              label
0  n01440764                                tench, Tinca tinca,
1  n01443537                       goldfish, Carassius auratus,
2  n01484850  great white shark, white shark, man-eater, man...
3  n01491361                   tiger shark, Galeocerdo cuvieri,
4  n01494475                      hammerhead, hammerhead shark,
5  n01496331        electric ray, crampfish, numbfish, torpedo,
6  n01498041                                          stingray,
7  n01514668                                              cock,
8  n01514859                                               hen,
9  n01518878                         ostrich, Struthio camelus,

In [42]:
sysnet_label_df['label'] = sysnet_label_df['label'].apply(lambda x: x.split(',')[0])
sysnet_label_df['label'].head(100)

0                      tench
1                   goldfish
2          great white shark
3                tiger shark
4                 hammerhead
               ...
95                   jacamar
96                    toucan
97                     drake
98    red-breasted merganser
99                     goose
Name: label, Length: 100, dtype: object

In [43]:
sysnet_label_df['label'][700][0] == " "

False

In [44]:
classes_df = pd.read_csv('../imagenet_classes.csv')
classes_df.reset_index(inplace=True)
classes_df.head()

   index              class
0      0              tench
1      1           goldfish
2      2  great white shark
3      3        tiger shark
4      4         hammerhead

In [45]:
merged = pd.merge(left=sysnet_label_df, right=classes_df, left_on='label', right_on='class')
merged

      sysnet_id              label  index              class
0     n01440764              tench      0              tench
1     n01443537           goldfish      1           goldfish
2     n01484850  great white shark      2  great white shark
3     n01491361        tiger shark      3        tiger shark
4     n01494475         hammerhead      4         hammerhead
...         ...                ...    ...                ...
997   n13044778          earthstar    995          earthstar
998   n13052670   hen-of-the-woods    996   hen-of-the-woods
999   n13054560             bolete    997             bolete
1000  n13133613                ear    998                ear
1001  n15075141      toilet tissue    999      toilet tissue

[1002 rows x 4 columns]

In [47]:
merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1002 entries, 0 to 1001
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   sysnet_id  1002 non-null   object
 1   label      1002 non-null   object
 2   index      1002 non-null   int64
 3   class      1002 non-null   object
dtypes: int64(1), object(3)
memory usage: 39.1+ KB

In [48]:
merged.to_csv("test.csv",  index=False)

In [51]:
labels_df = pd.read_csv('../labels.csv')
labels_df = labels_df[['index', 'sysnet_id', 'class']]
labels_df

     index  sysnet_id              class
0        0  n01440764              tench
1        1  n01443537           goldfish
2        2  n01484850  great white shark
3        3  n01491361        tiger shark
4        4  n01494475         hammerhead
..     ...        ...                ...
995    995  n13044778          earthstar
996    996  n13052670   hen-of-the-woods
997    997  n13054560             bolete
998    998  n13133613                ear
999    999  n15075141      toilet tissue

[1000 rows x 3 columns]